brew "awscli"
brew "bat"
brew "coursier"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "fasd"
brew "gh"
brew "just"
brew "neovim"
brew "node"
brew "reattach-to-user-namespace"  # tmux yank
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rustup"
brew "shellcheck"
brew "tmux"
brew "ansifilter"  # tmux logging
brew "tree-sitter-cli"
brew "ty"
brew "uv"
brew "wget"
brew "claude-code"
brew "texlive"
# cask "mactex-no-gui"
# brew "texlab"
brew "biber"
brew "pandoc"
brew "zellij"

cask "kitty"
cask "kiro-cli"

cargo "cargo-update"

uv "dot-py"
uv "pre-commit"
uv "pynvim"


# brew "colima"
# brew "docker", link: false
# brew "docker-compose"
# cask "docker-desktop"
# brew "imagemagick"
# brew "maven"
# brew "python-tk@3.14"
# brew "python@3.14"
# brew "yarn"
# cask "amazon-q"
# cask "tabby"
# cask "wezterm@nightly"
# cargo "generate-bidi"
# cargo "strip-ansi-escapes"
# cargo "sync-color-schemes"
# cargo "wezterm"
