# Shell / terminal
brew "fish"
brew "tmux"
brew "ansifilter"   # tmux-logging
cask "kitty"

# CLI core
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "just"
brew "ripgrep"
brew "rsync"
brew "wget"

# Git
brew "gh"

# Editors / nvim provider
brew "neovim"
brew "tree-sitter-cli"  # parser compiler for nvim-treesitter (main branch)

# Languages / toolchains
brew "node"
brew "rustup"
brew "uv"

# Python tooling
brew "ruff"

# AI tooling
tap "anomalyco/tap"             # OpenCode (custom tap, always up to date)
brew "anomalyco/tap/opencode"
cask "claude-code"
cask "kiro-cli"
brew "bubblewrap"
cask "codex"

# Docs / writing
brew "biber"        # biblatex bibliographies
brew "pandoc"
brew "texlive"

# Shell scripting
brew "shellcheck"

# Cloud
brew "awscli"

# Cargo
cargo "cargo-update"

# uv tools
uv "dot-py"
uv "pre-commit"
uv "pynvim"

# Optional — uncomment as needed
# brew "colima"
# brew "docker", link: false
# brew "docker-compose"
# brew "imagemagick"
# brew "maven"
# brew "python@3.14"
# brew "python-tk@3.14"
# brew "yarn"
# cask "amazon-q"
# cask "docker-desktop"
# cask "tabby"
# cask "wezterm@nightly"
# cargo "generate-bidi"
# cargo "strip-ansi-escapes"
# cargo "sync-color-schemes"
# cargo "wezterm"
